[
  {
    "skillId": 1,
    "skillName": "Beginner Guitar Lessons",
    "providerName": "Alex Martin",
    "providerEmail": "alex@skillswap.com",
    "price": 20,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "This beginner guitar course is perfect for anyone who has always wanted to play but didn’t know where to start. You’ll learn basic chords, rhythm techniques, and popular songs in an easy and fun way. Each session is practical, engaging, and helps you build a strong musical foundation for future growth. This beginner guitar course is perfect for anyone who has always wanted to play but didn’t know where to start. You’ll learn basic chords, rhythm techniques, and popular songs in an easy and fun way. Each session is practical, engaging, and helps you build a strong musical foundation for future growth. This beginner guitar course is perfect for anyone who has always wanted to play but didn’t know where to start. You’ll learn basic chords, rhythm techniques, and popular songs in an easy and fun way. Each session is practical, engaging, and helps you build a strong musical foundation for future growth.",
    "image": "https://i.ibb.co.com/Kz99dg4C/guitar.jpg",
    "category": "Music"
  },
  {
    "skillId": 2,
    "skillName": "Spoken English Practice",
    "providerName": "Sara Hossain",
    "providerEmail": "sara@skillswap.com",
    "price": 10,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Improve your spoken English through fun, conversation-based sessions designed for non-native speakers. You’ll practice real-life communication, pronunciation, and vocabulary in a friendly environment. These lessons build confidence and fluency, helping you speak naturally and effectively in both personal and professional settings. Improve your spoken English through fun, conversation-based sessions designed for non-native speakers. You’ll practice real-life communication, pronunciation, and vocabulary in a friendly environment. These lessons build confidence and fluency, helping you speak naturally and effectively in both personal and professional settings. Improve your spoken English through fun, conversation-based sessions designed for non-native speakers. You’ll practice real-life communication, pronunciation, and vocabulary in a friendly environment. These lessons build confidence and fluency, helping you speak naturally and effectively in both personal and professional settings.",
    "image": "https://i.ibb.co.com/Mxnxmyct/english.jpg",
    "category": "Language"
  },
  {
    "skillId": 3,
    "skillName": "Basic Yoga and Meditation",
    "providerName": "Priya Sharma",
    "providerEmail": "priya@skillswap.com",
    "price": 15,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Discover balance and peace through this beginner-friendly yoga and meditation program. Learn essential postures, breathing techniques, and mindfulness practices that reduce stress and improve flexibility. Perfect for anyone looking to relax, reconnect with their body, and build a sustainable wellness routine for daily life. Discover balance and peace through this beginner-friendly yoga and meditation program. Learn essential postures, breathing techniques, and mindfulness practices that reduce stress and improve flexibility. Perfect for anyone looking to relax, reconnect with their body, and build a sustainable wellness routine for daily life. Discover balance and peace through this beginner-friendly yoga and meditation program. Learn essential postures, breathing techniques, and mindfulness practices that reduce stress and improve flexibility. Perfect for anyone looking to relax, reconnect with their body, and build a sustainable wellness routine for daily life.",
    "image": "https://i.ibb.co.com/kgt608Hg/yoga.jpg",
    "category": "Health & Fitness"
  },
  {
    "skillId": 4,
    "skillName": "Intro to Web Development",
    "providerName": "Michael Tan",
    "providerEmail": "michael@skillswap.com",
    "price": 25,
    "rating": 4.7,
    "slotsAvailable": 2,
    "description": "Kickstart your journey into web development by learning HTML, CSS, and JavaScript through real projects. You’ll understand how websites work, create your own layouts, and write simple interactive features. Whether you’re a student or aspiring developer, this course helps you build your first responsive website with confidence. Kickstart your journey into web development by learning HTML, CSS, and JavaScript through real projects. You’ll understand how websites work, create your own layouts, and write simple interactive features. Whether you’re a student or aspiring developer, this course helps you build your first responsive website with confidence. Kickstart your journey into web development by learning HTML, CSS, and JavaScript through real projects. You’ll understand how websites work, create your own layouts, and write simple interactive features. Whether you’re a student or aspiring developer, this course helps you build your first responsive website with confidence.",
    "image": "https://i.ibb.co.com/n8nYkbRb/web-dev.jpg",
    "category": "Technology"
  },
  {
    "skillId": 5,
    "skillName": "Cooking Traditional Italian Pasta",
    "providerName": "Giulia Rossi",
    "providerEmail": "giulia@skillswap.com",
    "price": 18,
    "rating": 4.5,
    "slotsAvailable": 3,
    "description": "Experience the art of Italian cooking with hands-on pasta-making lessons. Learn to create fresh dough, prepare delicious sauces, and master authentic Italian techniques passed down through generations. Each session combines culture, creativity, and taste, giving you the skills to cook mouthwatering pasta dishes at home. Experience the art of Italian cooking with hands-on pasta-making lessons. Learn to create fresh dough, prepare delicious sauces, and master authentic Italian techniques passed down through generations. Each session combines culture, creativity, and taste, giving you the skills to cook mouthwatering pasta dishes at home. Experience the art of Italian cooking with hands-on pasta-making lessons. Learn to create fresh dough, prepare delicious sauces, and master authentic Italian techniques passed down through generations. Each session combines culture, creativity, and taste, giving you the skills to cook mouthwatering pasta dishes at home.",
    "image": "https://i.ibb.co.com/HD7qVc64/pasta-cooking.jpg",
    "category": "Cooking"
  },
  {
    "skillId": 6,
    "skillName": "Digital Photography Basics",
    "providerName": "Ethan Walker",
    "providerEmail": "ethan@skillswap.com",
    "price": 22,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "Learn the fundamentals of digital photography, from understanding camera settings to mastering composition and lighting. This course focuses on both outdoor and portrait photography, helping you take professional-quality photos. Perfect for beginners who want to capture meaningful moments and improve creative visual storytelling skills. Learn the fundamentals of digital photography, from understanding camera settings to mastering composition and lighting. This course focuses on both outdoor and portrait photography, helping you take professional-quality photos. Perfect for beginners who want to capture meaningful moments and improve creative visual storytelling skills. Learn the fundamentals of digital photography, from understanding camera settings to mastering composition and lighting. This course focuses on both outdoor and portrait photography, helping you take professional-quality photos. Perfect for beginners who want to capture meaningful moments and improve creative visual storytelling skills.",
    "image": "https://i.ibb.co.com/xqhRzkP6/photography.jpg",
    "category": "Photography"
  },
  {
    "skillId": 7,
    "skillName": "Creative Writing Workshop",
    "providerName": "Lina Rahman",
    "providerEmail": "lina@skillswap.com",
    "price": 12,
    "rating": 4.4,
    "slotsAvailable": 6,
    "description": "Unleash your imagination in this creative writing workshop that focuses on storytelling, structure, and character development. You’ll receive personalized feedback and exercises that enhance your narrative voice and writing style. Ideal for aspiring authors or anyone who loves expressing ideas through words. Unleash your imagination in this creative writing workshop that focuses on storytelling, structure, and character development. You’ll receive personalized feedback and exercises that enhance your narrative voice and writing style. Ideal for aspiring authors or anyone who loves expressing ideas through words. Unleash your imagination in this creative writing workshop that focuses on storytelling, structure, and character development. You’ll receive personalized feedback and exercises that enhance your narrative voice and writing style. Ideal for aspiring authors or anyone who loves expressing ideas through words.",
    "image": "https://i.ibb.co.com/21qXwBNn/writing.jpg",
    "category": "Writing"
  },
  {
    "skillId": 8,
    "skillName": "Beginner Spanish Lessons",
    "providerName": "Carlos Rivera",
    "providerEmail": "carlos@skillswap.com",
    "price": 14,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Start learning Spanish through simple, structured lessons that focus on pronunciation, essential vocabulary, and conversational practice. You’ll engage in fun, interactive sessions that make language learning enjoyable. By the end, you’ll be able to hold basic conversations and understand common expressions with confidence. Start learning Spanish through simple, structured lessons that focus on pronunciation, essential vocabulary, and conversational practice. You’ll engage in fun, interactive sessions that make language learning enjoyable. By the end, you’ll be able to hold basic conversations and understand common expressions with confidence. Start learning Spanish through simple, structured lessons that focus on pronunciation, essential vocabulary, and conversational practice. You’ll engage in fun, interactive sessions that make language learning enjoyable. By the end, you’ll be able to hold basic conversations and understand common expressions with confidence.",
    "image": "https://i.ibb.co.com/hx6HGKKS/spanish.jpg",
    "category": "Language"
  }
]
